app/Controllers/ConfederacionesController.php

SELECT *
FROM `confederaciones`
WHERE `confederaciones`.`deleted_at` IS NULL
---
    public function index()
    {
        $data['confederaciones'] = $this->confederacionesModel->findAll();

INSERT INTO `confederaciones` (`nombre`, `logo`, `id_usuario_creo`, `created_at`, `updated_at`) VALUES ('UEFA', 'https://upload.wikimedia.org/wikipedia/en/thumb/9/9d/UEFA_full_logo.svg/500px-UEFA_full_logo.svg.png', 1, '2026-05-14 03:15:48', '2026-05-14 03:15:48')
---
    public function store()
    {
        // Validación
        if (!$this->validate([
            'nombre' => 'required|max_length[100]',
            'logo' => 'permit_empty|max_length[255]|valid_url',
        ])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        try {
            $data = [
                'nombre' => $this->request->getPost('nombre'),
                'logo' => $this->request->getPost('logo'),
                'id_usuario_creo' => session()->get('user_id') ?? 1, // Asumir usuario 1 por ahora
            ];

            $this->confederacionesModel->insert($data);